# GetViewDisplayModel Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetViewDisplayModel Method
View Class See Also
---
Returns the current view display model settings for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ViewDisplayModel GetViewDisplayModel()
```

Visual Basic
---
```text
Public Function GetViewDisplayModel As ViewDisplayModel
```

Visual C++
---
```text
public:
ViewDisplayModel^ GetViewDisplayModel()
```

# ### Return Value
Current view display model settings.
# See Also
View Class
Autodesk.Revit.DB Namespace